# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Luis\Documents\PSoC Creator\SecuenciadorNotas\Seq.cydsn\Seq.cyprj
# Date: Wed, 26 Jun 2019 13:17:22 GMT
#set_units -time ns
create_clock -name {Clock_2(routed)} -period 50625 -waveform {0 25312.5} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {Clock_3(routed)} -period 47791.666666666664 -waveform {0 23895.8333333333} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {Clock_1(routed)} -period 56833.333333333328 -waveform {0 28416.6666666667} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {Clock_4(routed)} -period 56833.333333333328 -waveform {0 28416.6666666667} [list [get_pins {ClockBlock/dclk_3}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {ADC_LongitudNota_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 15 31} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {UART_1_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 27 53} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 1215 2431} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_3} -source [get_pins {ClockBlock/clk_sync}] -edges {1 1147 2295} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 1365 2729} -nominal_period 56833.333333333328 [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {Clock_4} -source [get_pins {ClockBlock/clk_sync}] -edges {1 1365 2729} -nominal_period 56833.333333333328 [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {timer_clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 240001 480001} [list [get_pins {ClockBlock/dclk_glb_5}]]


# Component constraints for C:\Users\Luis\Documents\PSoC Creator\SecuenciadorNotas\Seq.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Luis\Documents\PSoC Creator\SecuenciadorNotas\Seq.cydsn\Seq.cyprj
# Date: Wed, 26 Jun 2019 13:17:10 GMT
